uhnp/src/AccumulationRegisters/РасчетыСКонтрагентамиФакт/РасчетыСКонтрагентамиФакт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РасчетыСКонтрагентамиФакт</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <attributes>
    <name>СтатьяБюджета</name>
    <type>
      <types>Characteristic.ВидыБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриходРасход</name>
    <type>
      <types>EnumRef.ВидыДвиженийПриходРасход</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидБюджета</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговораУХ</name>
    <type>
      <types>CatalogRef.ВидыДоговоровКонтрагентовУХ</types>
    </type>
  </attributes>
  <attributes>
    <name>НачальныеОстатки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>DefinedType.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>DefinedType.Договор</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектРасчетов</name>
    <type>
      <types>DefinedType.ОбъектРасчетовУХ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЭлементСтруктурыЗадолженности</name>
    <type>
      <types>EnumRef.ЭлементыСтруктурыЗадолженности</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

uhnp/src/AccumulationRegisters/РасчетыСПоставщиками/РасчетыСПоставщиками.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РасчетыСПоставщиками</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>Оплачивается</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>КОплате</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>КПоступлению</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормаОплаты</name>
    <type>
      <types>EnumRef.ФормыОплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаявкаНаРасходованиеДенежныхСредств</name>
    <type>
      <types>DocumentRef.ЗаявкаНаРасходованиеДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗакупкаПоЗаказу</name>
    <type>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>DocumentRef.ЗаказПереработчику</types>
      <types>DocumentRef.ЗаказПереработчику2_5</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистратора</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПлатежа</name>
    <comment>Заполняется для поступления товаров и услуг</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаРегл</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаУпр</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗалогЗаТару</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДвиженияДенежныхСредств</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>РасчетныйДокумент</name>
    <type>
      <types>DefinedType.РасчетныйДокументСПоставщиком</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокОперации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокЗачетаПоДатеПлатежа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СвязанныйДокумент</name>
    <type>
      <types>DefinedType.РасчетныйДокументСПоставщиком</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантОплаты</name>
    <type>
      <types>EnumRef.ВариантыКонтроляОплатыПоставщику</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>КорОбъектРасчетов</name>
    <type>
      <types>CatalogRef.ОбъектыРасчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>КорАналитикаУчетаПоПартнерам</name>
    <type>
      <types>CatalogRef.КлючиАналитикиУчетаПоПартнерам</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкаХозяйственнойОперации</name>
    <type>
      <types>CatalogRef.НастройкиХозяйственныхОпераций</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторФинЗаписи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектРасчетовПриемник</name>
    <type>
      <types>CatalogRef.ОбъектыРасчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаУчетаПоПартнерамПриемник</name>
    <type>
      <types>CatalogRef.КлючиАналитикиУчетаПоПартнерам</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаПриемник</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПриемник</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоДаннымОбъектаРасчетовИсточника</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Сторно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОперацияВзаиморасчетов</name>
    <type>
      <types>EnumRef.ОперацииВзаиморасчетов</types>
    </type>
  </attributes>
  <dimensions>
    <name>АналитикаУчетаПоПартнерам</name>
    <type>
      <types>CatalogRef.КлючиАналитикиУчетаПоПартнерам</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектРасчетов</name>
    <type>
      <types>CatalogRef.ОбъектыРасчетов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

uhnp/src/InformationRegisters/РазмещениеЗаявок/РазмещениеЗаявок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РазмещениеЗаявок</name>
  <resources>
    <name>БанковскийСчетКасса</name>
    <type>
      <types>DefinedType.БанковскийСчетКасса</types>
    </type>
  </resources>
  <resources>
    <name>Контрагент</name>
    <type>
      <types>DefinedType.АналитикаПланированияКонтрагент</types>
    </type>
  </resources>
  <resources>
    <name>СуммаВзаиморасчетов</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>ФормаОплаты</name>
    <type>
      <types>EnumRef.ФормыОплаты</types>
    </type>
  </resources>
  <resources>
    <name>ВалютаВзаиморасчетов</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <resources>
    <name>Проведен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КурсПлатежа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>21</precision>
        <scale>10</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗапретИзмененияДаты</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВалютаОплаты</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <resources>
    <name>ВидОперацииУХ</name>
    <type>
      <types>CatalogRef.ВидыОперацийУХ</types>
    </type>
  </resources>
  <resources>
    <name>ДатаИсполнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>СчетКонтрагента</name>
    <type>
      <types>DefinedType.БанковскийСчетКонтрагента</types>
    </type>
  </resources>
  <resources>
    <name>ЗапретИзмененияБанковскогоСчетаКассы</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЗапретРазбиенияСлияния</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторВстречнойПозиции</name>
    <type>
      <types>UUID</types>
    </type>
  </resources>
  <resources>
    <name>КратностьПлатежа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Организация</name>
    <type>
      <types>DefinedType.Организации</types>
    </type>
  </resources>
  <resources>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>DefinedType.Договор</types>
    </type>
  </resources>
  <resources>
    <name>Приоритет</name>
    <type>
      <types>CatalogRef.ПриоритетыПлатежей</types>
    </type>
  </resources>
  <resources>
    <name>БезакцептноеСписание</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СпособОпределенияКурсаПлатежа</name>
    <type>
      <types>EnumRef.СпособыОпределенияКурсаПлатежа</types>
    </type>
  </resources>
  <resources>
    <name>ДатаФиксацииКурсаПлатежа</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>КурсПлатежаНеБолее</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КурсПлатежаНеМенее</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КурсПлатежаНеМенееВВалютеОплаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КурсПлатежаНеБолееВВалютеОплаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СдвигДатыФиксацииКурсаПлатежа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КрайняяДата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>КурсУстановленВЗаявке</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </resources>
  <resources>
    <name>ЛицевойСчет</name>
    <type>
      <types>CatalogRef.БанковскиеСчетаКонтрагентов</types>
    </type>
  </resources>
  <dimensions>
    <name>ЗаявкаНаОперацию</name>
    <type>
      <types>DefinedType.ДокументыПлатежнойПозиции</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПриходРасход</name>
    <type>
      <types>EnumRef.ВидыДвиженийПриходРасход</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторПозиции</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/InformationRegisters/СостоянияИсполненияДокументовПланирования/СостоянияИсполненияДокументовПланирования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СостоянияИсполненияДокументовПланирования</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>СостояниеИсполнения</name>
    <type>
      <types>EnumRef.СостоянияИсполненияЗаявки</types>
    </type>
  </resources>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументИзменившийСостояние</name>
    <type>
      <types>DefinedType.ДокументыИзменяющиеСостояниеДокументовПланирования</types>
    </type>
  </attributes>
  <dimensions>
    <name>ДокументПланирования</name>
    <type>
      <types>DefinedType.ДокументыПлатежнойПозиции</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторПозиции</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/InformationRegisters/АналитикаУчетаПоПартнерам/АналитикаУчетаПоПартнерам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>АналитикаУчетаПоПартнерам</name>
  <resources>
    <name>КлючАналитики</name>
    <type>
      <types>CatalogRef.КлючиАналитикиУчетаПоПартнерам</types>
    </type>
  </resources>
  <dimensions>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыМеждуОрганизациями</types>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/Enums/РолиКонтрагентов/РолиКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РолиКонтрагентов</name>
  <enumValues>
    <name>Покупатели</name>
  </enumValues>
  <enumValues>
    <name>Поставщики</name>
  </enumValues>
  <enumValues>
    <name>Банки</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/ВидыДвиженийПриходРасход/ВидыДвиженийПриходРасход.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДвиженийПриходРасход</name>
  <enumValues>
    <name>Приход</name>
  </enumValues>
  <enumValues>
    <name>Расход</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/СостоянияИсполненияЗаявки/СостоянияИсполненияЗаявки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияИсполненияЗаявки</name>
  <enumValues>
    <name>НеОбработана</name>
  </enumValues>
  <enumValues>
    <name>Отложена</name>
  </enumValues>
  <enumValues>
    <name>ВключенаВРеестрПлатежей</name>
  </enumValues>
  <enumValues>
    <name>НаИсполнении</name>
  </enumValues>
  <enumValues>
    <name>Исполнена</name>
  </enumValues>
  <enumValues>
    <name>Отменена</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/CommonModules/КонтрольУХВстраивание/Module.bsl
#Область ПрограммныйИнтерфейс

// Регистрирует проверки
Процедура ВсеПроверки(ОбщиеМодулиКонтроля) Экспорт
	
	//ОбщиеМодулиКонтроля.Вставить(<ПланыВидовХарактеристик.ВидыКонтроляДокументов.НовыйВидКонтроля>, <ИмяМодуляОтвечающегоЗаПроверку>); 
	ОбщиеМодулиКонтроля.Вставить(ПланыВидовХарактеристик.ВидыКонтроляДокументов.КонтрольОбъемаЗакупок, КонтрольУХОбъемыЗакупок);
    
КонецПроцедуры

Процедура РазмещениеИсточниковКонтроля(РазмещениеИсточников) Экспорт
	
	// Планирование потребностей
	РазмещениеИсточников.Вставить(Метаданные.Документы.СтрокаПланаЗакупок, ПланированиеПотребностей);
	РазмещениеИсточников.Вставить(Метаданные.Документы.Лот, ПланированиеПотребностей);
	РазмещениеИсточников.Вставить(Метаданные.Документы.ПротоколВыбораПобедителей, ПланированиеПотребностей); 
	РазмещениеИсточников.Вставить(Метаданные.Документы.ПланЗакупок, ПланированиеПотребностей);

	РазмещениеИсточников.Вставить(Метаданные.Документы.ЗаказПоставщику, ЗаказПоставщикуСерверВнедрениеЕХ);
	РазмещениеИсточников.Вставить(Метаданные.Документы.ЗаказКлиента, ВстраиваниеУХЗаказКлиента);
	РазмещениеИсточников.Вставить(Метаданные.Документы.ПриобретениеТоваровУслуг, ВстраиваниеУХПриобретениеТоваровУслуг);
	РазмещениеИсточников.Вставить(Метаданные.Документы.РеализацияТоваровУслуг, ВстраиваниеУХРеализацияТоваровУслуг);
	
	РазмещениеИсточников.Вставить(Метаданные.Документы.АктВыполненныхРабот, ВстраиваниеУХАктВыполненныхРабот);
	РазмещениеИсточников.Вставить(Метаданные.Документы.ЗаявкаНаВозвратТоваровОтКлиента, ВстраиваниеУХЗаявкаНаВозвратТоваровОтКлиента);
	РазмещениеИсточников.Вставить(Метаданные.Документы.ПриобретениеУслугПрочихАктивов, ВстраиваниеУХПриобретениеУслугПрочихАктивов);

КонецПроцедуры

// Регистрация дополнительных ключей для синхронизации пометки удаления
Процедура ВсеКлючи(Результат) Экспорт
	
КонецПроцедуры

// Измерения ключей, для которых не производится синхронизация пометки удаления
Процедура ИзмеренияКлючейИсключения(Результат) Экспорт
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Процедура - При встриваниеии внутри процедуры может быть переопределена структура источника для проверки
//
// Параметры:
//  Проверка			 - Структура	 - Описание проверки
//  СтруктураИсточник	 - Структура	 - Описание источника для проверки
//
Процедура СтруктураИсточник(Проверка, СтруктураИсточник) Экспорт
	
	Если Проверка.ВидКонтроля = ПланыВидовХарактеристик.ВидыКонтроляДокументов.КонтрольРасходовПоДоговору Тогда
		СтруктураИсточник.ДанныеДляПроверки.Колонки.Добавить("ОбъектРасчетов", Новый ОписаниеТипов("СправочникСсылка.ОбъектыРасчетов"));
	КонецЕсли;
	
КонецПроцедуры

// Функция возвращает запрос для получения исполнения по контрагенту по роли Поставщик
Функция ТекстЗапроса_ТекущаяЗадолженностьКонтрагентаПоЕгоРоли() Экспорт
	
	#Область УХ
	Возврат 
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.РолиКонтрагентов.Поставщики) КАК РольКонтрагента,
	|	ЗНАЧЕНИЕ(Справочник.ВидыДоговоровКонтрагентовУХ.СПоставщиком) КАК ВидДоговораУХ,
	|	1 КАК Коффициент
	|ПОМЕСТИТЬ ВТ_РолиВидыДоговоров
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.РолиКонтрагентов.Покупатели),
	|	ЗНАЧЕНИЕ(Справочник.ВидыДоговоровКонтрагентовУХ.СПокупателем),
	|	-1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасчетыСПоставщикамиПоСрокамОстатки.Контрагент КАК Контрагент,
	|	РасчетыСПоставщикамиПоСрокамОстатки.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	РасчетыСПоставщикамиПоСрокамОстатки.СуммаОстаток * ВТ_РолиВидыДоговоров.Коффициент КАК ЗадолженностьТекущая,
	|	РасчетыСПоставщикамиПоСрокамОстатки.Валюта КАК Валюта,
	|	ВалютаУправленческогоУчета.Значение КАК ВалютаУпручета
	|ПОМЕСТИТЬ ВТ_ЗадолженностьКонтрагентаВВалютеВзаиморасчетов
	|ИЗ
	|	Константа.ВалютаУправленческогоУчета КАК ВалютаУправленческогоУчета,
	|	ВТ_РолиВидыДоговоров КАК ВТ_РолиВидыДоговоров
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСКонтрагентамиФакт.Остатки(
	|				,
	|				Контрагент = &Контрагент
	|					И ДоговорКонтрагента.ВидДоговораУХ В
	|						(ВЫБРАТЬ
	|							ВТ_РолиВидыДоговоров.ВидДоговораУХ КАК ВидДоговораУХ
	|						ИЗ
	|							ВТ_РолиВидыДоговоров КАК ВТ_РолиВидыДоговоров
	|						ГДЕ
	|							ВТ_РолиВидыДоговоров.РольКонтрагента = &РольКонтрагента)) КАК РасчетыСПоставщикамиПоСрокамОстатки
	|		ПО (ВТ_РолиВидыДоговоров.РольКонтрагента = &РольКонтрагента)
	|			И ВТ_РолиВидыДоговоров.ВидДоговораУХ = РасчетыСПоставщикамиПоСрокамОстатки.ДоговорКонтрагента.ВидДоговораУХ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ЗадолженностьКонтрагентаВВалютеВзаиморасчетов.Контрагент КАК Контрагент,
	|	ВТ_ЗадолженностьКонтрагентаВВалютеВзаиморасчетов.ВалютаУпручета КАК ВалютаУпручета,
	|	СУММА(ВТ_ЗадолженностьКонтрагентаВВалютеВзаиморасчетов.ЗадолженностьТекущая * ВТ_КоэффициентыПересчета.Коэффициент) КАК ЗадолженностьТекущая
	|ПОМЕСТИТЬ ВТ_ЗадолженностьКонтрагента
	|ИЗ
	|	ВТ_ЗадолженностьКонтрагентаВВалютеВзаиморасчетов КАК ВТ_ЗадолженностьКонтрагентаВВалютеВзаиморасчетов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КоэффициентыПересчета КАК ВТ_КоэффициентыПересчета
	|		ПО ВТ_ЗадолженностьКонтрагентаВВалютеВзаиморасчетов.Валюта = ВТ_КоэффициентыПересчета.ВалютаВзаиморасчетов
	|			И ВТ_ЗадолженностьКонтрагентаВВалютеВзаиморасчетов.ВалютаУпручета = ВТ_КоэффициентыПересчета.ВалютаУпрУчета
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ЗадолженностьКонтрагентаВВалютеВзаиморасчетов.Контрагент,
	|	ВТ_ЗадолженностьКонтрагентаВВалютеВзаиморасчетов.ВалютаУпручета";
	
	#КонецОбласти 
	
КонецФункции

// Функция возвращает текст запроса для получения исполнения по договору
Функция ТекстЗапроса_ИсполнениеПоДоговору() Экспорт
	
	Возврат 
	"ВЫБРАТЬ
	|	РасчетыСКонтрагентамиФактОбороты.Организация КАК Организация,
	|	РасчетыСКонтрагентамиФактОбороты.Контрагент КАК Контрагент,
	|	РасчетыСКонтрагентамиФактОбороты.ДоговорКонтрагента КАК Договор,
	|	РасчетыСКонтрагентамиФактОбороты.Валюта КАК Валюта,
	|	СУММА(ВЫБОР
	|			КОГДА &Оплата = ИСТИНА
	|				ТОГДА РасчетыСКонтрагентамиФактОбороты.СуммаПриход
	|			ИНАЧЕ РасчетыСКонтрагентамиФактОбороты.СуммаРасход
	|		КОНЕЦ) КАК Исполнено
	|ПОМЕСТИТЬ ВТ_Исполнено
	|ИЗ
	|	РегистрНакопления.РасчетыСКонтрагентамиФакт.Обороты(
	|			,
	|			,
	|			Регистратор,
	|			Организация = &Организация
	|				И Контрагент = &Контрагент
	|				И ДоговорКонтрагента = &Договор) КАК РасчетыСКонтрагентамиФактОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	РасчетыСКонтрагентамиФактОбороты.Организация,
	|	РасчетыСКонтрагентамиФактОбороты.Контрагент,
	|	РасчетыСКонтрагентамиФактОбороты.ДоговорКонтрагента,
	|	РасчетыСКонтрагентамиФактОбороты.Валюта";
	
КонецФункции

// Возвращает массив типов ДокументСсылка, для которых не надо формировать подключаемую команду КонтрольДокументов
Процедура ТипыДокументовИсключенияДляПодключаемойКоманды(Исключения) Экспорт
	
	Исключения.Добавить(Тип("ДокументСсылка.ВводОстатковВзаиморасчетовПоАренде"));
	Исключения.Добавить(Тип("ДокументСсылка.ЗаключениеДоговораАренды"));
	Исключения.Добавить(Тип("ДокументСсылка.ИзменениеУсловийДоговораАренды"));
	Исключения.Добавить(Тип("ДокументСсылка.ЗаявкаНаКомандировку"));     
	Исключения.Добавить(Тип("ДокументСсылка.АктВыполненныхРабот"));  
	Исключения.Добавить(Тип("ДокументСсылка.ПриобретениеТоваровУслуг"));    
	Исключения.Добавить(Тип("ДокументСсылка.РеализацияТоваровУслуг")); 
	Исключения.Добавить(Тип("ДокументСсылка.ПриобретениеУслугПрочихАктивов")); 
	Исключения.Добавить(Тип("ДокументСсылка.ЗаказКлиента")); 

	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(
		Исключения, РаботаСДоговорамиКонтрагентовУХ.ТипыВерсийСоглашений());
	
КонецПроцедуры

// Функция возвращает признак, необходимо ли создавать команду КонтрольДокумента в форме документа, контролируемого по
// старой технологии. Для версий соглашений не создаем команду контроля документов, контроль осуществляется через
// компанду "Обновить фактические данные"
Функция СоздаватьКомандуКонтрольДокумента(ТипКонтролируемогоОбъекта) Экспорт   
	Возврат Истина;  
КонецФункции

#Область РасходыПоДоговору

Функция ТекстЗапроса_Предел() Экспорт
	
	Возврат
	"ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Организация КАК Организация,
	|	ДоговорыКонтрагентов.Контрагент КАК Контрагент,
	|	ДоговорыКонтрагентов.Ссылка КАК Договор,
	|	ДоговорыКонтрагентов.ВерсияСоглашения КАК ВерсияСоглашения,
	|	ДоговорыКонтрагентов.ВалютаВзаиморасчетов КАК Валюта,
	|	ВложенныйЗапрос.ЭтоОплата КАК ЭтоОплата,
	|	ВЫБОР
	|		КОГДА &ЭтоВерсияСоглашения
	|			ТОГДА &Заявлено
	|		ИНАЧЕ ЕСТЬNULL(ДоговорыКонтрагентов.ВерсияСоглашения.Сумма, 0)
	|	КОНЕЦ КАК Лимит
	|ПОМЕСТИТЬ ВТ_Лимит
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов,
	|	(ВЫБРАТЬ
	|		ЛОЖЬ КАК ЭтоОплата
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ИСТИНА) КАК ВложенныйЗапрос
	|ГДЕ
	|	ДоговорыКонтрагентов.Ссылка В
	|			(ВЫБРАТЬ
	|				ВТ_ЗаявленоИзменение.Договор
	|			ИЗ
	|				ВТ_ЗаявленоИзменение КАК ВТ_ЗаявленоИзменение)";
	
КонецФункции

Функция ТекстЗапроса_РасходыПоДоговору_ЗаявленоИзменение() Экспорт

	Возврат
	"ВЫБРАТЬ
	|	ВТ_ДанныеДляПроверки.ЭтоОплата КАК ЭтоОплата,
	|	ВЫБОР
	|		КОГДА ВЫРАЗИТЬ(ВТ_ДанныеДляПроверки.Организация КАК Справочник.Организации).ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА ВТ_ДанныеДляПроверки.Организация
	|		ИНАЧЕ ВЫРАЗИТЬ(ВТ_ДанныеДляПроверки.Организация КАК Справочник.Организации).ГоловнаяОрганизация
	|	КОНЕЦ КАК Организация,
	|	ВТ_ДанныеДляПроверки.Контрагент КАК Контрагент,
	|	ВТ_ДанныеДляПроверки.Договор КАК Договор,
	|	НЕОПРЕДЕЛЕНО КАК ОбъектРасчетов,
	|	ВТ_ДанныеДляПроверки.Валюта КАК Валюта,
	|	СУММА(ВТ_ДанныеДляПроверки.Сумма) КАК ЗаявленоИзменение
	|ПОМЕСТИТЬ ВТ_ЗаявленоИзменение
	|ИЗ
	|	ВТ_ДанныеДляПроверки КАК ВТ_ДанныеДляПроверки
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ДанныеДляПроверки.ЭтоОплата,
	|	ВТ_ДанныеДляПроверки.Контрагент,
	|	ВТ_ДанныеДляПроверки.Договор,
	|	ВТ_ДанныеДляПроверки.Валюта,
	|	ВЫБОР
	|		КОГДА ВЫРАЗИТЬ(ВТ_ДанныеДляПроверки.Организация КАК Справочник.Организации).ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА ВТ_ДанныеДляПроверки.Организация
	|		ИНАЧЕ ВЫРАЗИТЬ(ВТ_ДанныеДляПроверки.Организация КАК Справочник.Организации).ГоловнаяОрганизация
	|	КОНЕЦ";
	
КонецФункции

Функция ТекстЗапроса_РасходыПоДоговору_Факт() Экспорт
	
	Возврат
	"ВЫБРАТЬ
	|	РасчетыСПоставщиками.Регистратор КАК Регистратор,
	|	РасчетыСПоставщиками.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	РасчетыСПоставщиками.ОбъектРасчетов КАК ОбъектРасчетов,
	|	РасчетыСПоставщиками.Валюта КАК Валюта,
	|	РасчетыСПоставщиками.РасчетныйДокумент КАК РасчетныйДокумент,
	|	РасчетыСПоставщиками.ВидДвижения КАК ВидДвижения,
	|	РасчетыСПоставщиками.Сумма КАК Сумма,
	|	РасчетыСПоставщиками.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	ВЫБОР
	|		КОГДА РасчетыСПоставщиками.Регистратор ССЫЛКА Документ.РасходныйКассовыйОрдер
	|				ИЛИ РасчетыСПоставщиками.Регистратор ССЫЛКА Документ.ПриходныйКассовыйОрдер
	|				ИЛИ РасчетыСПоставщиками.Регистратор ССЫЛКА Документ.СписаниеБезналичныхДенежныхСредств
	|				ИЛИ РасчетыСПоставщиками.Регистратор ССЫЛКА Документ.ПоступлениеБезналичныхДенежныхСредств
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоОплата
	|ПОМЕСТИТЬ ВТ_Данные
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщиками КАК РасчетыСПоставщиками
	|ГДЕ
	|	РасчетыСПоставщиками.АналитикаУчетаПоПартнерам В
	|			(ВЫБРАТЬ
	|				ВТ_АналитикиУчетаПоПартнерам.КлючАналитики КАК КлючАналитики
	|			ИЗ
	|				ВТ_АналитикиУчетаПоПартнерам КАК ВТ_АналитикиУчетаПоПартнерам)
	|	И РасчетыСПоставщиками.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗачетАвансаПоставщику)
	|	И РасчетыСПоставщиками.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеКредиторскойЗадолженности)
	|	И НЕ РасчетыСПоставщиками.Регистратор ССЫЛКА Документ.КорректировкаРегистров
	|	И РасчетыСПоставщиками.Сумма <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Запрос1.ЭтоОплата КАК ЭтоОплата,
	|	ВЫРАЗИТЬ(Запрос1.АналитикаУчетаПоПартнерам КАК Справочник.КлючиАналитикиУчетаПоПартнерам).Организация КАК Организация,
	|	ВЫРАЗИТЬ(Запрос1.АналитикаУчетаПоПартнерам КАК Справочник.КлючиАналитикиУчетаПоПартнерам).Контрагент КАК Контрагент,
	|	ВЫРАЗИТЬ(Запрос1.АналитикаУчетаПоПартнерам КАК Справочник.КлючиАналитикиУчетаПоПартнерам).Договор КАК Договор,
	|	Запрос1.Валюта КАК Валюта,
	|	СУММА(Запрос1.Исполнено) КАК Исполнено
	|ПОМЕСТИТЬ ВТ_Факт
	|ИЗ
	|	(ВЫБРАТЬ
	|		ИСТИНА КАК ЭтоОплата,
	|		ВТ_Данные.Регистратор КАК ДокументРегистратор,
	|		ВТ_Данные.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|		ВТ_Данные.ОбъектРасчетов КАК ОбъектРасчетов,
	|		ВТ_Данные.Валюта КАК Валюта,
	|		ВТ_Данные.РасчетныйДокумент КАК РасчетныйДокумент,
	|		ВТ_Данные.ВидДвижения КАК ВидДвижения,
	|		ВЫБОР
	|			КОГДА ВТ_Данные.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ТОГДА 1
	|			ИНАЧЕ -1
	|		КОНЕЦ * ВТ_Данные.Сумма КАК Исполнено,
	|		ВТ_Данные.ХозяйственнаяОперация КАК ХозяйственнаяОперация
	|	ИЗ
	|		ВТ_Данные КАК ВТ_Данные
	|	ГДЕ
	|		ВТ_Данные.Сумма <> 0
	|		И ВТ_Данные.ЭтоОплата
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ЛОЖЬ,
	|		ВТ_Данные.Регистратор,
	|		ВТ_Данные.АналитикаУчетаПоПартнерам,
	|		ВТ_Данные.ОбъектРасчетов,
	|		ВТ_Данные.Валюта,
	|		ВТ_Данные.РасчетныйДокумент,
	|		ВТ_Данные.ВидДвижения,
	|		ВЫБОР
	|			КОГДА ВТ_Данные.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ТОГДА 1
	|			ИНАЧЕ -1
	|		КОНЕЦ * ВТ_Данные.Сумма,
	|		ВТ_Данные.ХозяйственнаяОперация
	|	ИЗ
	|		ВТ_Данные КАК ВТ_Данные
	|	ГДЕ
	|		ВТ_Данные.Сумма <> 0
	|		И НЕ ВТ_Данные.ЭтоОплата
	|		И НЕ ВТ_Данные.Регистратор ССЫЛКА Документ.ВозвратТоваровПоставщику
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ЛОЖЬ,
	|		ВТ_Данные.Регистратор,
	|		ВТ_Данные.АналитикаУчетаПоПартнерам,
	|		ВТ_Данные.ОбъектРасчетов,
	|		ВТ_Данные.Валюта,
	|		ВТ_Данные.РасчетныйДокумент,
	|		ВТ_Данные.ВидДвижения,
	|		-ВТ_Данные.Сумма,
	|		ВТ_Данные.ХозяйственнаяОперация
	|	ИЗ
	|		ВТ_Данные КАК ВТ_Данные
	|	ГДЕ
	|		ВТ_Данные.Регистратор ССЫЛКА Документ.ВозвратТоваровПоставщику
	|		И ВТ_Данные.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВзаимозачетЗадолженности)) КАК Запрос1
	|
	|СГРУППИРОВАТЬ ПО
	|	Запрос1.ЭтоОплата,
	|	Запрос1.АналитикаУчетаПоПартнерам,
	|	Запрос1.Валюта,
	|	ВЫРАЗИТЬ(Запрос1.АналитикаУчетаПоПартнерам КАК Справочник.КлючиАналитикиУчетаПоПартнерам).Договор,
	|	ВЫРАЗИТЬ(Запрос1.АналитикаУчетаПоПартнерам КАК Справочник.КлючиАналитикиУчетаПоПартнерам).Организация,
	|	ВЫРАЗИТЬ(Запрос1.АналитикаУчетаПоПартнерам КАК Справочник.КлючиАналитикиУчетаПоПартнерам).Контрагент
	|
	|ИМЕЮЩИЕ
	|	СУММА(Запрос1.Исполнено) <> 0";
	
КонецФункции

Функция ТекстЗапроса_РасходыПоДоговору_Заявлено() Экспорт

	Возврат
	"ВЫБРАТЬ
	|	ИСТИНА КАК ЭтоОплата,
	|	ВЫБОР
	|		КОГДА РазмещениеЗаявок.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА РазмещениеЗаявок.Организация
	|		ИНАЧЕ РазмещениеЗаявок.Организация.ГоловнаяОрганизация
	|	КОНЕЦ КАК Организация,
	|	РазмещениеЗаявок.Контрагент КАК Контрагент,
	|	РазмещениеЗаявок.ДоговорКонтрагента КАК Договор,
	|	РазмещениеЗаявок.ВалютаВзаиморасчетов КАК Валюта,
	|	ВЫБОР
	|		КОГДА РазмещениеЗаявок.ПриходРасход = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийПриходРасход.Расход)
	|			ТОГДА РазмещениеЗаявок.СуммаВзаиморасчетов
	|		ИНАЧЕ -РазмещениеЗаявок.СуммаВзаиморасчетов
	|	КОНЕЦ КАК Заявлено
	|ПОМЕСТИТЬ ВТ_Заявлено
	|ИЗ
	|	РегистрСведений.РазмещениеЗаявок КАК РазмещениеЗаявок
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияИсполненияДокументовПланирования.СрезПоследних КАК СостоянияИсполненияДокументовПланированияСрезПоследних
	|		ПО РазмещениеЗаявок.ЗаявкаНаОперацию = СостоянияИсполненияДокументовПланированияСрезПоследних.ДокументПланирования
	|			И РазмещениеЗаявок.ИдентификаторПозиции = СостоянияИсполненияДокументовПланированияСрезПоследних.ИдентификаторПозиции
	|			И (СостоянияИсполненияДокументовПланированияСрезПоследних.СостояниеИсполнения В (ЗНАЧЕНИЕ(Перечисление.СостоянияИсполненияЗаявки.НеОбработана), ЗНАЧЕНИЕ(Перечисление.СостоянияИсполненияЗаявки.НаИсполнении), ЗНАЧЕНИЕ(Перечисление.СостоянияИсполненияЗаявки.ВключенаВРеестрПлатежей)))
	|ГДЕ
	|	(ВЫБОР
	|			КОГДА РазмещениеЗаявок.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|				ТОГДА РазмещениеЗаявок.Организация
	|			ИНАЧЕ РазмещениеЗаявок.Организация.ГоловнаяОрганизация
	|		КОНЕЦ, РазмещениеЗаявок.Контрагент, РазмещениеЗаявок.ДоговорКонтрагента, РазмещениеЗаявок.Проведен) В
	|			(ВЫБРАТЬ
	|				ВТ_ДанныеДляПроверки.Организация,
	|				ВТ_ДанныеДляПроверки.Контрагент,
	|				ВТ_ДанныеДляПроверки.Договор,
	|				ИСТИНА
	|			ИЗ
	|				ВТ_ДанныеДляПроверки)
	|	И (РазмещениеЗаявок.ЗаявкаНаОперацию <> &Документ
	|			ИЛИ &ЭтоВерсияСоглашения)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЛОЖЬ,
	|	ВЫБОР
	|		КОГДА ОперацииБюджетовОбороты.АналитикаСтруктуры.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА ОперацииБюджетовОбороты.АналитикаСтруктуры.Организация
	|		ИНАЧЕ ОперацииБюджетовОбороты.АналитикаСтруктуры.Организация.ГоловнаяОрганизация
	|	КОНЕЦ,
	|	ОперацииБюджетовОбороты.АналитикаПартнеров.Контрагент,
	|	ОперацииБюджетовОбороты.АналитикаПартнеров.Договор,
	|	ОперацииБюджетовОбороты.Валюта,
	|	ОперацииБюджетовОбороты.СуммаОборот
	|ИЗ
	|	РегистрНакопления.ОперацииБюджетов.Обороты(
	|			,
	|			,
	|			,
	|			ОбъектПланирования <> &Документ
	|				И ВидБюджета <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыБюджетов.БюджетДвиженияДенежныхСредств)
	|				И (ПриходРасход, ВЫБОР
	|					КОГДА АналитикаСтруктуры.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|						ТОГДА АналитикаСтруктуры.Организация
	|					ИНАЧЕ АналитикаСтруктуры.Организация.ГоловнаяОрганизация
	|				КОНЕЦ, АналитикаПартнеров.Контрагент, АналитикаПартнеров.Договор) В
	|					(ВЫБРАТЬ
	|						ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийПриходРасход.Расход),
	|						ВТ_ДанныеДляПроверки.Организация,
	|						ВТ_ДанныеДляПроверки.Контрагент,
	|						ВТ_ДанныеДляПроверки.Договор
	|					ИЗ
	|						ВТ_ДанныеДляПроверки)) КАК ОперацииБюджетовОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЛОЖЬ,
	|	ВЫБОР
	|		КОГДА ОперацииБюджетовОбороты.АналитикаСтруктуры.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА ОперацииБюджетовОбороты.АналитикаСтруктуры.Организация
	|		ИНАЧЕ ОперацииБюджетовОбороты.АналитикаСтруктуры.Организация.ГоловнаяОрганизация
	|	КОНЕЦ,
	|	ОперацииБюджетовОбороты.АналитикаПартнеров.Контрагент,
	|	ОперацииБюджетовОбороты.АналитикаПартнеров.Договор,
	|	ОперацииБюджетовОбороты.Валюта,
	|	-ОперацииБюджетовОбороты.СуммаИсполненоОборот
	|ИЗ
	|	РегистрНакопления.ОперацииБюджетов.Обороты(
	|			,
	|			,
	|			,
	|			ОбъектПланирования <> &Документ
	|				И ТИПЗНАЧЕНИЯ(ОбъектПланирования) = ТИП(ДОкумент.ЗаявкаНарасход)
	|				И ВидБюджета <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыБюджетов.БюджетДвиженияДенежныхСредств)
	|				И (ПриходРасход, ВЫБОР
	|					КОГДА АналитикаСтруктуры.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|						ТОГДА АналитикаСтруктуры.Организация
	|					ИНАЧЕ АналитикаСтруктуры.Организация.ГоловнаяОрганизация
	|				КОНЕЦ, АналитикаПартнеров.Контрагент, АналитикаПартнеров.Договор) В
	|					(ВЫБРАТЬ
	|						ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийПриходРасход.Расход),
	|						ВТ_ДанныеДляПроверки.Организация,
	|						ВТ_ДанныеДляПроверки.Контрагент,
	|						ВТ_ДанныеДляПроверки.Договор
	|					ИЗ
	|						ВТ_ДанныеДляПроверки)) КАК ОперацииБюджетовОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АналитикаУчетаПоПартнерам.КлючАналитики КАК КлючАналитики
	|ПОМЕСТИТЬ ВТ_АналитикиУчетаПоПартнерам
	|ИЗ
	|	РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам
	|ГДЕ
	|	АналитикаУчетаПоПартнерам.Договор В
	|			(ВЫБРАТЬ
	|				ВТ_Заявлено.Договор КАК Договор
	|			ИЗ
	|				ВТ_Заявлено КАК ВТ_Заявлено)";
	
КонецФункции

#КонецОбласти 

#КонецОбласти
